import json
import requests

# emoji_dict = {
#     # Из первого словаря (с заглавными буквами)
#     "Гроза с слабым дождем": "🌩️",
#     "Гроза с дождем": "⛈️",
#     "Гроза с сильным дождем": "⛈️",
#     "Слабая гроза": "🌩️",
#     "Гроза": "⛈️",
#     "Сильная гроза": "⛈️",
#     "Неровная гроза": "⛈️",
#     "Гроза со слабой моросью": "🌩️",
#     "Гроза с моросью": "🌩️",
#     "Гроза с сильной моросью": "🌩️",
#     "Слабая морось": "🌦️",
#     "Морось": "💧",
#     "Сильная морось": "🌧️",
#     "Морось со слабым дождем": "🌦️",
#     "Морось с дождем": "🌦️",
#     "Сильная морось с дождем": "🌧️",
#     "Ливень с моросью": "🌦️",
#     "Сильный ливень с моросью": "🌧️",
#     "Ливневая морось": "🌦️",
#     "Слабый дождь": "🌦️",
#     "Умеренный дождь": "🌧️",
#     "Сильный дождь": "🌧️",
#     "Очень сильный дождь": "🌧️",
#     "Экстремальный дождь": "🌧️",
#     "Дождь": "🌧️",
#     "Ледяной дождь": "🌨️",
#     "Слабый ливневый дождь": "🌦️",
#     "Ливневый дождь": "🌦️",
#     "Сильный ливневый дождь": "🌧️",
#     "Неровный ливневый дождь": "🌧️",
#     "Слабый снег": "🌨️",
#     "Снег": "❄️",
#     "Сильный снег": "❄️",
#     "Мокрый снег": "🌨️",
#     "Слабый ливневый мокрый снег": "🌨️",
#     "Ливневый мокрый снег": "🌨️",
#     "Слабый дождь со снегом": "🌨️",
#     "Дождь со снегом": "🌨️",
#     "Слабый ливневый снег": "🌨️",
#     "Ливневый снег": "❄️",
#     "Сильный ливневый снег": "❄️",
#     "Морось": "🌫️",
#     "Дым": "🌫️",
#     "Дымка": "🌫️",
#     "Пыльные вихри": "🌪️",
#     "Туман": "🌫️",
#     "Плотный туман": "🌫️",
#     "Песок": "🌪️",
#     "Пыль": "🌫️",
#     "Вулканический пепел": "🌋",
#     "Шквалы": "🌪️",
#     "Торнадо": "🌪️",
#     "Ветрено": "🌬️",
#     "Сильный ветер": "🌪️",
    
#     # Из второго словаря (добавлены/обновлены)
#     "Ясно": "☀️",
#     "Небольшая облачность": "🌤️",
#     "Облачно с прояснениями": "⛅",
#     "Пасмурно": "☁️",
#     "Очень жарко": "🥵",
#     "Холодно": "🥶",
#     "Переменная облачность": "⛅",
#     "Малооблачно": "⛅"
# }


def get_weather(city, API_WEATHER_TOKEN):
    response = requests.get(f'https://api.openweathermap.org/data/2.5/weather?q={city}&units=metric&lang=ru&appid={API_WEATHER_TOKEN}')
    res = json.loads(response.text)
    if response.status_code != 200:
        return (response.status_code, "")
    description = res["weather"][0]["description"].capitalize()
    
    temp = int(res["main"]["temp"])
    return (response.status_code, f'{description} | {temp}°C')